balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1827.PIC
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="nrnn-nnn" edc:cname="CM1CON0" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-100" edc:name="CM1CON0" edc:nzwidth="0x8" edc:por="0000-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="C1SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C1HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1SP" edc:desc="Comparator Speed/Power Select bit" edc:mask="0x1" edc:name="C1SP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C1POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="C1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1OE" edc:desc="Comparator Output Enable bit" edc:mask="0x1" edc:name="C1OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1ON" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="C1ON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="CM1CON1" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="CM1CON1" edc:nzwidth="0x8" edc:por="0000--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1NCH0" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1NCH1" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C1PCH0" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH1" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="C1INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="C1INTP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1NCH" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x3" edc:name="C1NCH" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C1PCH" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x3" edc:name="C1PCH" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnn-nnn" edc:cname="CM2CON0" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-100" edc:name="CM2CON0" edc:nzwidth="0x8" edc:por="0000-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C2SYNC" edc:desc="" edc:mask="0x1" edc:name="C2SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2HYS" edc:desc="" edc:mask="0x1" edc:name="C2HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2SP" edc:desc="" edc:mask="0x1" edc:name="C2SP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2POL" edc:desc="" edc:mask="0x1" edc:name="C2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OE" edc:desc="" edc:mask="0x1" edc:name="C2OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2ON" edc:desc="" edc:mask="0x1" edc:name="C2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="CM2CON1" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="CM2CON1" edc:nzwidth="0x8" edc:por="0000--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C2NCH0" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x1" edc:name="C2NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2NCH1" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x1" edc:name="C2NCH1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C2PCH0" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x1" edc:name="C2PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH1" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x1" edc:name="C2PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="C2INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="C2INTP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2NCH" edc:desc="Comparator Negative Input Channel Select bits" edc:mask="0x3" edc:name="C2NCH" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="C2PCH" edc:desc="Comparator Positive Input Channel Select bits" edc:mask="0x3" edc:name="C2PCH" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------rr" edc:cname="CMOUT" edc:desc="Comparator Output Register" edc:impl="0x03" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CMOUT" edc:nzwidth="8" edc:por="------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MC1OUT" edc:desc="" edc:mask="0x1" edc:name="MC1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MC2OUT" edc:desc="" edc:mask="0x1" edc:name="MC2OUT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n------r" edc:cname="BORCON" edc:desc="Brown-out Reset Control Register" edc:impl="0x81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u------u" edc:name="BORCON" edc:nzwidth="8" edc:por="1------q">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BORRDY" edc:desc="Brown-out Reset Circuit Ready Status bit" edc:mask="0x1" edc:name="BORRDY" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="SBOREN" edc:desc="Software Brown Out Reset Enable bit" edc:mask="0x1" edc:name="SBOREN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnnnnnn" edc:cname="FVRCON" edc:desc="Fixed Voltage Reference Control Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0q000000" edc:name="FVRCON" edc:nzwidth="8" edc:por="0q000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADFVR0" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="ADFVR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADFVR1" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="ADFVR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR0" edc:desc="Comparator and D/A Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="CDAFVR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR1" edc:desc="Comparator and D/A Converter Fixed Voltage Reference Selection" edc:mask="0x1" edc:name="CDAFVR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSRNG" edc:desc="Temperature Indicator Range Selection" edc:mask="0x1" edc:name="TSRNG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEN" edc:desc="Temperature Indicator Enable" edc:mask="0x1" edc:name="TSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVRRDY" edc:desc="Fixed Voltage Reference Ready Flag" edc:mask="0x1" edc:name="FVRRDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVREN" edc:desc="Fixed Voltage Reference Enable" edc:mask="0x1" edc:name="FVREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADFVR" edc:desc="A/D Converter Fixed Voltage Reference Selection" edc:mask="0x3" edc:name="ADFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CDAFVR" edc:desc="Comparator and D/A Converter Fixed Voltage Reference Selection" edc:mask="0x3" edc:name="CDAFVR" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nn-n" edc:cname="DACCON0" edc:desc="Voltage Reference Control Register 0" edc:impl="0xed" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-00-0" edc:name="DACCON0" edc:nzwidth="8" edc:por="000-00-0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="DAC1 Negative Source Select bits" edc:mask="0x1" edc:name="DACNSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="DAC1 Voltage Output Enable bit" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACLPS" edc:desc="DAC 1 Low Power Voltage State Select bit" edc:mask="0x1" edc:name="DACLPS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="DAC 1 Enable bit" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DACCON1" edc:desc="Voltage Reference Control Register 1" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="DACCON1" edc:nzwidth="8" edc:por="---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SRCON0" edc:desc="SR Latch Control Register 0" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SRCON0" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRPR" edc:desc="Pulse Reset Input of the SR Latch" edc:mask="0x1" edc:name="SRPR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRPS" edc:desc="Pulse Set Input of the SR Latch" edc:mask="0x1" edc:name="SRPS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRNQEN" edc:desc="SR Latch Q Output Enable bit" edc:mask="0x1" edc:name="SRNQEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRQEN" edc:desc="SR Latch Q Output Enable bit" edc:mask="0x1" edc:name="SRQEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK0" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK1" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK2" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRLEN" edc:desc="SR Latch Enable bit" edc:mask="0x1" edc:name="SRLEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SRCLK" edc:desc="SR Latch Clock divider bits" edc:mask="0x7" edc:name="SRCLK" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SRCON1" edc:desc="SR Latch Control Register 1" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SRCON1" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRRC1E" edc:desc="SR Latch C1 Reset Enable bit" edc:mask="0x1" edc:name="SRRC1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRC2E" edc:desc="SR Latch C2 Reset Enable bit" edc:mask="0x1" edc:name="SRRC2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRCKE" edc:desc="SR Latch Reset Clock Enable bit" edc:mask="0x1" edc:name="SRRCKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRPE" edc:desc="SR Latch Peripheral Reset Enable bit" edc:mask="0x1" edc:name="SRRPE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSC1E" edc:desc="SR Latch C1 Set Enable bit" edc:mask="0x1" edc:name="SRSC1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSC2E" edc:desc="SR Latch C2 Set Enable bit" edc:mask="0x1" edc:name="SRSC2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSCKE" edc:desc="SR Latch Set Clock Enable bit" edc:mask="0x1" edc:name="SRSCKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSPE" edc:desc="SR Latch Peripheral Set Enable bit" edc:mask="0x1" edc:name="SRSPE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APFCON0" edc:desc="Alternate Pin Function Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APFCON0" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1SEL" edc:desc="CCP2 Input/Output Pin Selection" edc:mask="0x1" edc:name="CCP1SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1CSEL" edc:desc="SS Input Pin Selection" edc:mask="0x1" edc:name="P1CSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1DSEL" edc:desc="Comparator 2 Output Pin Selection" edc:mask="0x1" edc:name="P1DSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2SEL" edc:desc="SR Latch nQ Output Pin Selection" edc:mask="0x1" edc:name="CCP2SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2BSEL" edc:desc="CCP2 PWM B Output Pin Selection" edc:mask="0x1" edc:name="P2BSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1SEL" edc:desc="Timer1 Gate Input Pin Selection" edc:mask="0x1" edc:name="SS1SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDO1SEL" edc:desc="CCP3 Input/Output Pin Selection" edc:mask="0x1" edc:name="SDO1SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXDTSEL" edc:desc="" edc:mask="0x1" edc:name="RXDTSEL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
